0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
   
      type          fixedValue;
    	value           uniform (0.5 0 0); // cm^2/s

    }
    
    outlet
    {
        type            zeroGradient;
    }

    "(wall.*)"
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }

    bottom
    {
        type             symmetryPlane;
    }

    frontAndBack
    {
        type             empty;
    }
    
}

// ************************************************************************* //
