constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{               
                type             Newtonian;

                rho              rho [1 -3 0 0 0 0 0] 1.05;
                eta             eta [1 -1 -1 0 0 0 0] 30000;
             //   etaP             etaP [1 -1 -1 0 0 0 0] .88889;               
             //   lambda           lambda [0 0 1 0 0 0 0] 0.0;

             //   stabilization    coupling;              
}

passiveScalarProperties
{
                solvePassiveScalar   no;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
