system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1; //mm -> cm

vertices
(
  (0  4 0.25)
  (15 4 0.25)
  (15 1 0.25)
  (0  1 0.25)
  (0  0 0.25)
  (15 0 0.25)
  (30 0 0.25)
  (30 1 0.25)//7
   
  (0  4 -0.25)
  (15 4 -0.25)
  (15 1 -0.25)
  (0  1 -0.25)
  (0  0 -0.25)
  (15 0 -0.25)
  (30 0 -0.25)
  (30 1 -0.25)//15
);

blocks
(
    hex (0 1 2 3 8 9 10 11) (75 15 1) simpleGrading (1 1 1)
    hex (3 2 5 4 11 10 13 12) (75 5 1) simpleGrading (1 1 1)
    hex (2 7 6 5 10 15 14 13) (75 5 1) simpleGrading (1 1 1)
    //hex (2 5 6 7 10 13 14 15) (75 1 5) simpleGrading (1 1 1)
    //hex (2 5 6 7 10 13 14 15) (75 1 5) simpleGrading (1 1 1)
);

edges
(
);

boundary
(

inlet
     {
      type patch;
      faces
      (
            (0 8 11 3)
            (3 11 12 4)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 9 8)
            (1 2 9 10)
            (2 7 15 10)
        );
    }
  
    outlet
    {
        type patch;
        faces
        (
            (7 6 14 15)
        );
    }
  
    bottom
    {
        type symmetryPlane;
        faces
        (
            (4 5 12 13)
            (5 6 13 14)
        );
    }  
 
   frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (3 2 5 4)
            (2 7 6 5)
            (8 9 10 11)
            (11 10 13 12)
            (10 15 14 13)
        );
    }   
);

mergePatchPairs
(
);

// ************************************************************************* //
